In [37]:
import pandas as pd
from sqlalchemy import create_engine
from app import app, db  # Import your Flask app and SQLAlchemy instance

In [38]:

# Database URI (same as in your Flask app)
DATABASE_URI = 'sqlite:///instance/zensprout.db'

In [39]:

# Create a SQLAlchemy engine
engine = create_engine(DATABASE_URI)

In [40]:

# Function to load a table into a DataFrame
def load_table_to_dataframe(table_name):
    query = f"SELECT * FROM {table_name};"
    df = pd.read_sql(query, engine)
    return df

In [41]:

# List of tables to inspect
tables = ['user', 'session']  # Add other table names if needed

In [42]:

# Load and display each table
for table in tables:
    print(f"\nContents of table '{table}':")
    df = load_table_to_dataframe(table)
    display(df)

Contents of table 'user':

,id,username,email,password,age,gender,goals,distractions,occupation
0,1,sarah_dev,sarah@example.com,scrypt:32768:8:1$0eDac5JKNjbkLqZW$f82a6e53ff5e...,28,female,"Improve coding skills, maintain work-life bala...","Social media, phone notifications, email checking",Software Developer

Contents of table 'session':

      id  user_id session_type  duration            timestamp
0      1        1         work      1800  2024-12-28 11:48:00
1      2        1         work      2880  2024-12-28 12:00:00
2      3        1        break       660  2024-12-28 16:24:00
3      4        1        break       420  2024-12-28 16:29:00
4      5        1         work      2520  2024-12-28 16:32:00
..   ...      ...          ...       ...                  ...
182  183        1        break       300  2025-01-26 12:06:00
183  184        1         work      1980  2025-01-26 14:12:00
184  185        1        break       660  2025-01-26 16:10:00
185  186        1        break       420  2025-01-26 16:50:00
186  187        1         work      2340  2025-01-26 17:19:00

[187 rows x 5 columns]